; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image3 - mode
	image1 - mode
	infrared5 - mode
	infrared6 - mode
	infrared4 - mode
	infrared7 - mode
	thermograph2 - mode
	image0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(supports instrument0 infrared7)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared7)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 infrared5)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image3)
	(supports instrument5 infrared6)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
)
(:goal (and
	(pointing satellite3 Star7)
	(have_image Phenomenon5 infrared4)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon6 thermograph2)
	(have_image Star7 image3)
	(have_image Star7 infrared6)
	(have_image Star8 image0)
	(have_image Star8 image1)
	(have_image Phenomenon9 infrared7)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 image1)
	(have_image Planet10 thermograph2)
	(have_image Star11 thermograph2)
	(have_image Star11 image1)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (turn_to satellite3 star0 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star0)
   goals met: 0 of 15
2. (turn_to satellite2 star0 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star0)
   goals met: 0 of 15
3. (turn_to satellite1 groundstation4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 15
4. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 15
5. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 15
6. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 15
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 15
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
9. (calibrate satellite3 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 15
10. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 15
11. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 15
12. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 15
13. (turn_to satellite0 phenomenon5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon5)
   goals met: 0 of 15
14. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 1 of 15
15. (turn_to satellite0 planet10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet10)
   goals met: 1 of 15
16. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 15
17. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 2 of 15
18. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 3 of 15
19. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 3 of 15
20. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 4 of 15
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 15
22. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 15
23. (turn_to satellite0 groundstation2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 15
24. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 15
25. (turn_to satellite0 phenomenon12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 15
26. (take_image satellite0 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 5 of 15
27. (turn_to satellite0 phenomenon6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 15
28. (take_image satellite0 phenomenon6 instrument1 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 6 of 15
29. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 15
30. (take_image satellite0 phenomenon9 instrument1 infrared7)
   added: (have_image phenomenon9 infrared7)
   goals met: 7 of 15
31. (take_image satellite0 phenomenon9 instrument1 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 8 of 15
32. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 8 of 15
33. (take_image satellite0 planet10 instrument1 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 9 of 15
34. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 9 of 15
35. (take_image satellite0 star11 instrument1 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 10 of 15
36. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 10 of 15
37. (take_image satellite1 star8 instrument3 image0)
   added: (have_image star8 image0)
   goals met: 11 of 15
38. (turn_to satellite2 star7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star7)
   goals met: 11 of 15
39. (take_image satellite2 star7 instrument5 image3)
   added: (have_image star7 image3)
   goals met: 12 of 15
40. (take_image satellite2 star7 instrument5 infrared6)
   added: (have_image star7 infrared6)
   goals met: 13 of 15
41. (turn_to satellite3 phenomenon5 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon5)
   goals met: 13 of 15
42. (take_image satellite3 phenomenon5 instrument7 infrared4)
   added: (have_image phenomenon5 infrared4)
   goals met: 14 of 15
43. (turn_to satellite3 star7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star7)
   goals met: 15 of 15
